tools/mutants/intt-scale-wrong.patch
--- a/src/ntt.s	2026-08-29 06:05:07
+++ b/src/ntt.s	2026-08-29 06:05:17
@@ -751,7 +751,7 @@
         sta nt_savex
         jsr itl_block_ready
         ; scale the lower half f[0..127] by 128^-1 (a public block constant)
-        lda #<MLKEM_N_INV
+        lda #<(MLKEM_N_INV - 1)
         sta fq_b_lo
         lda #>MLKEM_N_INV
         sta fq_b_hi
