tools/mutants/intt-scale-wrong.patch
--- a/src/ntt.s	2026-08-28 18:12:59
+++ b/src/ntt.s	2026-08-28 18:12:59
@@ -731,7 +731,7 @@
         asl nt_len                      ; 2 .. 128, then 0: done
         bne pi_layer
         ; scale every coefficient by 128^-1 (a public block constant)
-        lda #<MLKEM_N_INV
+        lda #<(MLKEM_N_INV - 1)
         sta fq_b_lo
         lda #>MLKEM_N_INV
         sta fq_b_hi
