tools/mutants/ntt-wrong-zeta.patch
--- a/src/mlkem_tables.inc	2026-08-28 18:12:59
+++ b/src/mlkem_tables.inc	2026-08-28 18:12:59
@@ -49,7 +49,7 @@
         .byte $28, $8F, $3B, $C4, $E6, $38, $C0, $35, $92, $2E, $17, $42, $59, $3F, $B6, $35   ; [ 16.. 31]
         .byte $21, $4B, $B5, $DC, $AD, $00, $E5, $07, $8A, $B9, $D1, $78, $31, $21, $28, $7B   ; [ 32.. 47]
         .byte $0F, $9B, $27, $C4, $9E, $34, $FE, $62, $57, $39, $C9, $88, $AA, $26, $CB, $8E   ; [ 48.. 63]
-        .byte $11, $C9, $47, $59, $65, $D3, $F0, $4C, $81, $66, $D1, $E9, $F4, $6C, $C7, $EA   ; [ 64.. 79]
+        .byte $11, $C9, $47, $59, $65, $D3, $F0, $4C, $81, $66, $D1, $E9, $F4, $F4, $C7, $EA   ; [ 64.. 79]
         .byte $A7, $73, $E5, $FD, $37, $B8, $B5, $7F, $AB, $04, $85, $54, $DD, $21, $0C, $81   ; [ 80.. 95]
         .byte $30, $FA, $F5, $94, $77, $F5, $2A, $6D, $27, $3F, $D5, $F5, $33, $31, $A2, $22   ; [ 96..111]
         .byte $F4, $44, $93, $02, $77, $66, $D7, $76, $BA, $BC, $52, $05, $3E, $77, $75, $6A   ; [112..127]
@@ -58,7 +58,7 @@
         .byte $01, $09, $05, $05, $0B, $00, $08, $05, $05, $08, $02, $0B, $09, $0B, $07, $03   ; [ 16.. 31]
         .byte $01, $01, $0C, $06, $04, $09, $08, $08, $02, $07, $09, $02, $0B, $00, $05, $07   ; [ 32.. 47]
         .byte $09, $05, $03, $01, $05, $0B, $05, $09, $0A, $0A, $05, $02, $09, $0C, $04, $03   ; [ 48.. 63]
-        .byte $00, $0A, $02, $0A, $06, $02, $08, $04, $05, $0A, $0C, $00, $02, $08, $0B, $0B   ; [ 64.. 79]
+        .byte $00, $0A, $02, $0A, $06, $02, $08, $04, $05, $0A, $0C, $00, $02, $02, $0B, $0B   ; [ 64.. 79]
         .byte $06, $06, $0A, $06, $07, $03, $05, $0A, $03, $09, $09, $09, $02, $09, $01, $02   ; [ 80.. 95]
         .byte $06, $08, $07, $0C, $01, $09, $08, $06, $04, $01, $0A, $02, $08, $02, $09, $0A   ; [ 96..111]
         .byte $0A, $04, $01, $04, $04, $08, $0A, $03, $06, $04, $07, $04, $08, $0B, $03, $08   ; [112..127]
