tools/mutants/wp2-rodata-align-reverted.patch
--- a/src/codec.s
+++ b/src/codec.s
@@ -99,8 +99,7 @@
 ; T_hi_d[h] = floor(h * 256 * 2^d / q), h = 0..13 (x < q => x >> 8 <= 13).
 ; All three d share one lo-byte table and one hi-byte table, indexed by
 ; 14 * d_index + h. Computed by the assembler from the definition.
-.align 64                ; WP1 merge fix: keep the straddle assert below layout-independent (cfg align = $40)
-cp_thi_lo:
+cp_thi_lo:                ; MUTANT: .align 64 dropped
 .repeat 14, h
         .byte <((h * 256 * 2) / MLKEM_Q)
 .endrepeat
@@ -110,8 +109,7 @@
 .repeat 14, h
         .byte <((h * 256 * 1024) / MLKEM_Q)
 .endrepeat
-.align 64                ; WP1 merge fix: keep the straddle assert below layout-independent (cfg align = $40)
-cp_thi_hi:
+cp_thi_hi:                ; MUTANT: .align 64 dropped
 .repeat 14, h
         .byte >((h * 256 * 2) / MLKEM_Q)
 .endrepeat
@@ -123,8 +121,7 @@
 .endrepeat
 
 ; T_lo[m] = floor(m * 4 * 1024 / q), m = 0..63 (d = 10; max 77 fits a byte).
-.align 64                ; WP1 merge fix: keep the straddle assert below layout-independent (cfg align = $40)
-cp_tlo:
+cp_tlo:                ; MUTANT: .align 64 dropped
 .repeat 64, m
         .byte <((m * 4 * 1024) / MLKEM_Q)
 .endrepeat
