tools/mutants/wp3-cmp-mismatch-timing.patch
--- a/src/kem.s	2026-09-22 21:28:40
+++ b/src/kem.s	2026-09-23 10:36:55
@@ -495,6 +495,7 @@
 
 ; --- cmp_len: cmp_acc |= (zp_src)[k] ^ (zp_dst)[k] for k < enc_len ---------------
 ; Full length, every byte, no early exit; consumes enc_len.
+        .res 6                      ; MUTANT: places the loop so only the back-branch crosses a page, as in the original
 .proc cmp_len
         ldx enc_len+1
         lda enc_len+0
@@ -504,8 +505,12 @@
 loop:
         lda (mlkem_zp_src),y
         eor (mlkem_zp_dst),y
-        ora cmp_acc
-        sta cmp_acc
+        beq same                    ; MUTANT: equal byte 3+2+3 = 8 cycles (as ora+sta abs)
+        sta cmp_acc                 ; mismatch: 2+4+3(+1) cycles -> leaks the mismatch count
+        bne next
+same:   nop
+        bit $00
+next:
         iny
         bne :+
         inc mlkem_zp_src+1
@@ -515,6 +520,7 @@
         dex
         bne loop
         rts
+        .res 246                    ; MUTANT pad: +256 B total, every later byte keeps its page offset
 .endproc
 
 ; =============================================================================
